# Tidy Data in Python

In [1]:
import pandas as pd
import datetime
import re

In [2]:
%load_ext watermark

In [3]:
#%watermark

In [4]:
%watermark -w -v -u -n -t -z -m -p pandas,datetime,re --iso8601 -a "Mantej Singh"

Mantej Singh
last updated: Mon Apr 10 2017 13:01:42 Eastern Daylight Time2017-04-10T13:01:42-04:00

CPython 3.5.2
IPython 5.1.0

pandas 0.19.0
datetime n
re 2.2.1

compiler   : MSC v.1900 32 bit (Intel)
system     : Windows
release    : 7
machine    : AMD64
processor  : Intel64 Family 6 Model 58 Stepping 9, GenuineIntel
CPU cores  : 4
interpreter: 32bit
watermark 1.3.4

# Part 1: 
    Pew Research Center Dataset

This dataset explores the relationship between income and religion.

Problem: The columns headers are composed of the possible income values.

In [5]:
df=pd.read_csv('data\pew-raw.csv')

In [6]:
df

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k
0,Agnostic,27,34,60,81,76,137
1,Atheist,12,27,37,52,35,70
2,Buddhist,27,21,30,34,33,58
3,Catholic,418,617,732,670,638,1116
4,Dont know/refused,15,14,15,11,10,35
5,Evangelical Prot,575,869,1064,982,881,1486
6,Hindu,1,9,7,9,11,34
7,Historically Black Prot,228,244,236,238,197,223
8,Jehovahs Witness,20,27,24,24,21,30
9,Jewish,19,19,25,25,30,95

In [35]:
new_df=pd.melt(df,["religion"],var_name="income_range",value_name="freq")

In [36]:
new_df=new_df.sort_values(["religion"])

In [37]:
new_df[:3]

    religion income_range  freq
0   Agnostic        <$10k    27
30  Agnostic      $30-40k    81
40  Agnostic      $40-50k    76

### Sorting the index

In [40]:
new_df=new_df.reset_index(drop='True')

In [42]:
#new_df=new_df.drop('index', axis=1).reset_index(drop='True')

In [44]:
new_df.head()

   religion income_range  freq
0  Agnostic        <$10k    27
1  Agnostic      $30-40k    81
2  Agnostic      $40-50k    76
3  Agnostic      $50-75k   137
4  Agnostic      $10-20k    34

# Part 2: 
    Billboard Top 100 Dataset

This dataset represents the weekly rank of songs from the moment they enter the Billboard Top 100 to the subsequent 75 weeks.

Problems:

The columns headers are composed of values: the week number (x1st.week, …)
If a song is in the Top 100 for less than 75 weeks, the remaining columns are filled with missing values.

In [99]:
df = pd.read_csv("data/billboard.csv", encoding="mac_latin2")
df.head(10)

,year,artist.inverted,track,time,genre,date.entered,date.peaked,x1st.week,x2nd.week,x3rd.week,...,x67th.week,x68th.week,x69th.week,x70th.week,x71st.week,x72nd.week,x73rd.week,x74th.week,x75th.week,x76th.week
0,2000,Destiny's Child,Independent Women Part I,3:38,Rock,2000-09-23,2000-11-18,78,63.0,49.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2000,Santana,"Maria, Maria",4:18,Rock,2000-02-12,2000-04-08,15,8.0,6.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2000,Savage Garden,I Knew I Loved You,4:07,Rock,1999-10-23,2000-01-29,71,48.0,43.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2000,Madonna,Music,3:45,Rock,2000-08-12,2000-09-16,41,23.0,18.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),3:38,Rock,2000-08-05,2000-10-14,57,47.0,45.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,2000,Janet,Doesn't Really Matter,4:17,Rock,2000-06-17,2000-08-26,59,52.0,43.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,2000,Destiny's Child,Say My Name,4:31,Rock,1999-12-25,2000-03-18,83,83.0,44.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,2000,"Iglesias, Enrique",Be With You,3:36,Latin,2000-04-01,2000-06-24,63,45.0,34.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,2000,Sisqo,Incomplete,3:52,Rock,2000-06-24,2000-08-12,77,66.0,61.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,2000,Lonestar,Amazed,4:25,Country,1999-06-05,2000-03-04,81,54.0,44.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [100]:
# Melting
id_vars = ["year",
           "artist.inverted",
           "track",
           "time",
           "genre",
           "date.entered",
           "date.peaked"]

In [101]:
df = pd.melt(frame=df,id_vars=id_vars, var_name="week", value_name="rank")
df[-5:]

,year,artist.inverted,track,time,genre,date.entered,date.peaked,week,rank
24087,2000,Ghostface Killah,Cherchez LaGhost,3:04,R&B,2000-08-05,2000-08-05,x76th.week,NaN
24088,2000,"Smith, Will",Freakin' It,3:58,Rap,2000-02-12,2000-02-12,x76th.week,NaN
24089,2000,Zombie Nation,Kernkraft 400,3:30,Rock,2000-09-02,2000-09-02,x76th.week,NaN
24090,2000,"Eastsidaz, The",Got Beef,3:58,Rap,2000-07-01,2000-07-01,x76th.week,NaN
24091,2000,Fragma,Toca's Miracle,3:22,R&B,2000-10-28,2000-10-28,x76th.week,NaN

In [102]:
df.dtypes

year                 int64
artist.inverted     object
track               object
time                object
genre               object
date.entered        object
date.peaked         object
week                object
rank               float64
dtype: object

In [103]:
# Formatting 
df.fillna(0, inplace=True)

In [104]:
df[:3]

,year,artist.inverted,track,time,genre,date.entered,date.peaked,week,rank
0,2000,Destiny's Child,Independent Women Part I,3:38,Rock,2000-09-23,2000-11-18,x1st.week,78.0
1,2000,Santana,"Maria, Maria",4:18,Rock,2000-02-12,2000-04-08,x1st.week,15.0
2,2000,Savage Garden,I Knew I Loved You,4:07,Rock,1999-10-23,2000-01-29,x1st.week,71.0

In [105]:
df["week"] = df['week'].str.extract('(\d+)', expand=False).astype(int)
df["rank"] = df["rank"].astype(int)

In [106]:
df[:3]

,year,artist.inverted,track,time,genre,date.entered,date.peaked,week,rank
0,2000,Destiny's Child,Independent Women Part I,3:38,Rock,2000-09-23,2000-11-18,1,78
1,2000,Santana,"Maria, Maria",4:18,Rock,2000-02-12,2000-04-08,1,15
2,2000,Savage Garden,I Knew I Loved You,4:07,Rock,1999-10-23,2000-01-29,1,71

In [107]:
# Cleaning out unnecessary rows
df = df.dropna()
df[:3]

,year,artist.inverted,track,time,genre,date.entered,date.peaked,week,rank
0,2000,Destiny's Child,Independent Women Part I,3:38,Rock,2000-09-23,2000-11-18,1,78
1,2000,Santana,"Maria, Maria",4:18,Rock,2000-02-12,2000-04-08,1,15
2,2000,Savage Garden,I Knew I Loved You,4:07,Rock,1999-10-23,2000-01-29,1,71

In [108]:
# Create "date" columns
#df['date'] = pd.to_datetime(df['date.entered']) 
df['date'] = pd.to_datetime(df['date.entered']) + pd.to_timedelta(df['week'], unit='w') - pd.DateOffset(weeks=1)

df[:3]

,year,artist.inverted,track,time,genre,date.entered,date.peaked,week,rank,date
0,2000,Destiny's Child,Independent Women Part I,3:38,Rock,2000-09-23,2000-11-18,1,78,2000-09-23
1,2000,Santana,"Maria, Maria",4:18,Rock,2000-02-12,2000-04-08,1,15,2000-02-12
2,2000,Savage Garden,I Knew I Loved You,4:07,Rock,1999-10-23,2000-01-29,1,71,1999-10-23

In [109]:
df.dtypes

year                        int64
artist.inverted            object
track                      object
time                       object
genre                      object
date.entered               object
date.peaked                object
week                        int32
rank                        int32
date               datetime64[ns]
dtype: object

### Selecting only imp columns

### One way to select columns

In [110]:
df = df[["year", 
         "artist.inverted",
         "track",
         "time",
         "genre",
         "week",
         "rank",
         "date"]]
df[:3]

,year,artist.inverted,track,time,genre,week,rank,date
0,2000,Destiny's Child,Independent Women Part I,3:38,Rock,1,78,2000-09-23
1,2000,Santana,"Maria, Maria",4:18,Rock,1,15,2000-02-12
2,2000,Savage Garden,I Knew I Loved You,4:07,Rock,1,71,1999-10-23

## SORTING + RESETTING THE INDEX

In [111]:
df = df.sort_values(ascending=True, by=["year","artist.inverted","track","week","rank"]).reset_index(drop='True')
df[:3]

,year,artist.inverted,track,time,genre,week,rank,date
0,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap,1,87,2000-02-26
1,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap,2,82,2000-03-04
2,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap,3,72,2000-03-11

## New in the next steps we will convert/Normalize this table into 2NF

### i.e seperate week data and rank into  seperate table

In [112]:
# Assigning the tidy dataset to a variable for future usage
billboard = df

In [113]:
billboard[:2]

,year,artist.inverted,track,time,genre,week,rank,date
0,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap,1,87,2000-02-26
1,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap,2,82,2000-03-04

### Multiple types in one table
 
Following up on the Billboard dataset, we’ll now address the repetition problem of the previous table.

Problems:

Multiple observational units (the song and its rank) in a single table.
We’ll first create a songs table which contains the details of each song:

In [114]:
songs_cols = ["year", "artist.inverted", "track", "time", "genre"]

### anotther way to select columns

In [115]:
#selecting colums + remoe duplicates 
songs = billboard[songs_cols].drop_duplicates()
songs[:3]

,year,artist.inverted,track,time,genre
0,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap
76,2000,2Ge+her,The Hardest Part Of Breaking Up (Is Getting Ba...,3:15,R&B
152,2000,3 Doors Down,Kryptonite,3:53,Rock

In [116]:
songs = songs.reset_index(drop=True)
songs[:3]

,year,artist.inverted,track,time,genre
0,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap
1,2000,2Ge+her,The Hardest Part Of Breaking Up (Is Getting Ba...,3:15,R&B
2,2000,3 Doors Down,Kryptonite,3:53,Rock

In [117]:
songs["song_id"] = songs.index
songs.head(10)

,year,artist.inverted,track,time,genre,song_id
0,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap,0
1,2000,2Ge+her,The Hardest Part Of Breaking Up (Is Getting Ba...,3:15,R&B,1
2,2000,3 Doors Down,Kryptonite,3:53,Rock,2
3,2000,3 Doors Down,Loser,4:24,Rock,3
4,2000,504 Boyz,Wobble Wobble,3:35,Rap,4
5,2000,98°,Give Me Just One Night (Una Noche),3:24,Rock,5
6,2000,A*Teens,Dancing Queen,3:44,Pop,6
7,2000,Aaliyah,I Don't Wanna,4:15,Rock,7
8,2000,Aaliyah,Try Again,4:03,Rock,8
9,2000,"Adams, Yolanda",Open My Heart,5:30,Gospel,9

### We’ll then create a ranks table which only contains the song_id, date and the rank.

In [122]:
ranks = pd.merge(billboard, songs, on=["year","artist.inverted", "track", "time", "genre"]).drop_duplicates()
ranks[:10]

,year,artist.inverted,track,time,genre,week,rank,date,song_id
0,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap,1,87,2000-02-26,0
1,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap,2,82,2000-03-04,0
2,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap,3,72,2000-03-11,0
3,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap,4,77,2000-03-18,0
4,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap,5,87,2000-03-25,0
5,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap,6,94,2000-04-01,0
6,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap,7,99,2000-04-08,0
7,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap,8,0,2000-04-15,0
8,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap,9,0,2000-04-22,0
9,2000,2 Pac,Baby Don't Cry (Keep Ya Head Up II),4:22,Rap,10,0,2000-04-29,0

### Simply select necessary columns

In [126]:
ranks = ranks[["song_id", "date","rank"]].drop_duplicates()
ranks.head(10)

   song_id       date  rank
0        0 2000-02-26    87
1        0 2000-03-04    82
2        0 2000-03-11    72
3        0 2000-03-18    77
4        0 2000-03-25    87
5        0 2000-04-01    94
6        0 2000-04-08    99
7        0 2000-04-15     0
8        0 2000-04-22     0
9        0 2000-04-29     0

### filtering pandas dataframes on dates

#### If it's the index, you should use the .ix or .loc selector.

In [129]:
ranks.ix['2000-02-02':'2000-03-12']

Empty DataFrame
Columns: [song_id, date, rank]
Index: []

### finding data on dates

In [133]:
ranks[(ranks['date'] > '2000-09-01') & (ranks['date'] < '2000-09-09')][:2]

    song_id       date  rank
27        0 2000-09-02     0
76        1 2000-09-02    91

# Part 3: 
    Tubercolosis Records from World Health Organization

This dataset documents the count of confirmed tuberculosis cases by country, year, age and sex.

Problems:

Some columns contain multiple values: sex and age.
Mixture of zeros and missing values NaN. This is due to the data collection process and the distinction is important for this dataset.

In [186]:
df = pd.read_csv("data/tb-raw.csv")
df

  country  year   m014  m1524   m2534  m3544  m4554  m5564    m65  mu   f014
0      AD  2000    0.0    0.0     1.0    0.0      0      0    0.0 NaN    NaN
1      AE  2000    2.0    4.0     4.0    6.0      5     12   10.0 NaN    3.0
2      AF  2000   52.0  228.0   183.0  149.0    129     94   80.0 NaN   93.0
3      AG  2000    0.0    0.0     0.0    0.0      0      0    1.0 NaN    1.0
4      AL  2000    2.0   19.0    21.0   14.0     24     19   16.0 NaN    3.0
5      AM  2000    2.0  152.0   130.0  131.0     63     26   21.0 NaN    1.0
6      AN  2000    0.0    0.0     1.0    2.0      0      0    0.0 NaN    0.0
7      AO  2000  186.0  999.0  1003.0  912.0    482    312  194.0 NaN  247.0
8      AR  2000   97.0  278.0   594.0  402.0    419    368  330.0 NaN  121.0
9      AS  2000    NaN    NaN     NaN    NaN      1      1    NaN NaN    NaN

### In order to tidy this dataset, we need to remove the different values from the header and unpivot them into rows. We’ll first need to melt the sex + age groupcolumns into a single one. Once we have that single column, we’ll derive three columns from it: sex, age_lower and age_upper. With those, we’ll be able to properly build a tidy dataset.

In [187]:
df = pd.melt(df, id_vars=["country","year"], value_name="cases", var_name="sex_and_age")
df[:2]

  country  year sex_and_age  cases
0      AD  2000        m014    0.0
1      AE  2000        m014    2.0

In [188]:
# Extract Sex, Age lower bound and Age upper bound group
tmp_df = df["sex_and_age"].str.extract("(\D)(\d+)(\d{2})",expand=False) 
tmp_df[:2]

   0  1   2
0  m  0  14
1  m  0  14

#### Setting names to columns

In [189]:
# Name columns
tmp_df.columns = ["sex", "age_lower", "age_upper"]
tmp_df[:2]

  sex age_lower age_upper
0   m         0        14
1   m         0        14

In [190]:
# Create `age`column based on `age_lower` and `age_upper`
tmp_df["age"]=tmp_df.age_lower + "-" + tmp_df.age_upper
tmp_df[:2]

  sex age_lower age_upper   age
0   m         0        14  0-14
1   m         0        14  0-14

In [191]:
# Merge 
df = pd.concat([df, tmp_df], axis=1)
df[:]

   country  year sex_and_age   cases  sex age_lower age_upper    age
0       AD  2000        m014     0.0    m         0        14   0-14
1       AE  2000        m014     2.0    m         0        14   0-14
2       AF  2000        m014    52.0    m         0        14   0-14
3       AG  2000        m014     0.0    m         0        14   0-14
4       AL  2000        m014     2.0    m         0        14   0-14
5       AM  2000        m014     2.0    m         0        14   0-14
6       AN  2000        m014     0.0    m         0        14   0-14
7       AO  2000        m014   186.0    m         0        14   0-14
8       AR  2000        m014    97.0    m         0        14   0-14
9       AS  2000        m014     NaN    m         0        14   0-14
10      AD  2000       m1524     0.0    m        15        24  15-24
11      AE  2000       m1524     4.0    m        15        24  15-24
12      AF  2000       m1524   228.0    m        15        24  15-24
13      AG  2000       m1524     0.0    m        15        24  15-24
14      AL  2000       m1524    19.0    m        15        24  15-24
15      AM  2000       m1524   152.0    m        15        24  15-24
16      AN  2000       m1524     0.0    m        15        24  15-24
17      AO  2000       m1524   999.0    m        15        24  15-24
18      AR  2000       m1524   278.0    m        15        24  15-24
19      AS  2000       m1524     NaN    m        15        24  15-24
20      AD  2000       m2534     1.0    m        25        34  25-34
21      AE  2000       m2534     4.0    m        25        34  25-34
22      AF  2000       m2534   183.0    m        25        34  25-34
23      AG  2000       m2534     0.0    m        25        34  25-34
24      AL  2000       m2534    21.0    m        25        34  25-34
25      AM  2000       m2534   130.0    m        25        34  25-34
26      AN  2000       m2534     1.0    m        25        34  25-34
27      AO  2000       m2534  1003.0    m        25        34  25-34
28      AR  2000       m2534   594.0    m        25        34  25-34
29      AS  2000       m2534     NaN    m        25        34  25-34
..     ...   ...         ...     ...  ...       ...       ...    ...
60      AD  2000         m65     0.0  NaN       NaN       NaN    NaN
61      AE  2000         m65    10.0  NaN       NaN       NaN    NaN
62      AF  2000         m65    80.0  NaN       NaN       NaN    NaN
63      AG  2000         m65     1.0  NaN       NaN       NaN    NaN
64      AL  2000         m65    16.0  NaN       NaN       NaN    NaN
65      AM  2000         m65    21.0  NaN       NaN       NaN    NaN
66      AN  2000         m65     0.0  NaN       NaN       NaN    NaN
67      AO  2000         m65   194.0  NaN       NaN       NaN    NaN
68      AR  2000         m65   330.0  NaN       NaN       NaN    NaN
69      AS  2000         m65     NaN  NaN       NaN       NaN    NaN
70      AD  2000          mu     NaN  NaN       NaN       NaN    NaN
71      AE  2000          mu     NaN  NaN       NaN       NaN    NaN
72      AF  2000          mu     NaN  NaN       NaN       NaN    NaN
73      AG  2000          mu     NaN  NaN       NaN       NaN    NaN
74      AL  2000          mu     NaN  NaN       NaN       NaN    NaN
75      AM  2000          mu     NaN  NaN       NaN       NaN    NaN
76      AN  2000          mu     NaN  NaN       NaN       NaN    NaN
77      AO  2000          mu     NaN  NaN       NaN       NaN    NaN
78      AR  2000          mu     NaN  NaN       NaN       NaN    NaN
79      AS  2000          mu     NaN  NaN       NaN       NaN    NaN
80      AD  2000        f014     NaN    f         0        14   0-14
81      AE  2000        f014     3.0    f         0        14   0-14
82      AF  2000        f014    93.0    f         0        14   0-14
83      AG  2000        f014     1.0    f         0        14   0-14
84      AL  2000        f014     3.0    f         0        14   0-14
85      AM  2000        f014     1.0    f         0        14   0-14
86      AN  2000        f014     0.0    f         0        14   0-14
87      AO  2000        f014   247.0    f         0        14   0-14
88      AR  2000        f014   121.0    f         0        14   0-14
89      AS  2000        f014     NaN    f         0        14   0-14

[90 rows x 8 columns]

In [192]:
# Drop unnecessary columns and rows
df = df.drop(['sex_and_age',"age_lower","age_upper"], axis=1)
df[62:68]

   country  year  cases  sex  age
62      AF  2000   80.0  NaN  NaN
63      AG  2000    1.0  NaN  NaN
64      AL  2000   16.0  NaN  NaN
65      AM  2000   21.0  NaN  NaN
66      AN  2000    0.0  NaN  NaN
67      AO  2000  194.0  NaN  NaN

In [193]:
df = df.dropna()
df[62:68]

   country  year  cases sex   age
87      AO  2000  247.0   f  0-14
88      AR  2000  121.0   f  0-14

In [194]:
df = df.sort_values(ascending=True,by=["country", "year", "sex", "age"]).reset_index(drop='True')
df.head(10)

  country  year  cases sex    age
0      AD  2000    0.0   m   0-14
1      AD  2000    0.0   m  15-24
2      AD  2000    1.0   m  25-34
3      AD  2000    0.0   m  35-44
4      AD  2000    0.0   m  45-54
5      AD  2000    0.0   m  55-64
6      AE  2000    3.0   f   0-14
7      AE  2000    2.0   m   0-14
8      AE  2000    4.0   m  15-24
9      AE  2000    4.0   m  25-34

In [196]:
df.dtypes

country     object
year         int64
cases      float64
sex         object
age         object
dtype: object

# Part 4 :
    Global Historical Climatology Network Dataset

This dataset represents the daily weather records for a weather station (MX17004) in Mexico for five months in 2010.

Problems:

Variables are stored in both rows (tmin, tmax) and columns (days).

In [17]:
df = pd.read_csv("data/weather-raw.csv")
df

         id  year  month element  d1    d2    d3  d4    d5  d6  d7  d8
0   MX17004  2010      1    tmax NaN   NaN   NaN NaN   NaN NaN NaN NaN
1   MX17004  2010      1    tmin NaN   NaN   NaN NaN   NaN NaN NaN NaN
2  MX17004   2010      2    tmax NaN  27.3  24.1 NaN   NaN NaN NaN NaN
3   MX17004  2010      2    tmin NaN  14.4  14.4 NaN   NaN NaN NaN NaN
4   MX17004  2010      3    tmax NaN   NaN   NaN NaN  32.1 NaN NaN NaN
5   MX17004  2010      3    tmin NaN   NaN   NaN NaN  14.2 NaN NaN NaN
6   MX17004  2010      4    tmax NaN   NaN   NaN NaN   NaN NaN NaN NaN
7   MX17004  2010      4    tmin NaN   NaN   NaN NaN   NaN NaN NaN NaN
8   MX17004  2010      5    tmax NaN   NaN   NaN NaN   NaN NaN NaN NaN
9   MX17004  2010      5    tmin NaN   NaN   NaN NaN   NaN NaN NaN NaN

In [18]:
df.dtypes

id          object
year         int64
month        int64
element     object
d1         float64
d2         float64
d3         float64
d4         float64
d5         float64
d6         float64
d7         float64
d8         float64
dtype: object

### Melting

In [19]:
df = pd.melt(df, id_vars=["id", "year","month","element"], var_name="day_raw")
df.head(10)

         id  year  month element day_raw  value
0   MX17004  2010      1    tmax      d1    NaN
1   MX17004  2010      1    tmin      d1    NaN
2  MX17004   2010      2    tmax      d1    NaN
3   MX17004  2010      2    tmin      d1    NaN
4   MX17004  2010      3    tmax      d1    NaN
5   MX17004  2010      3    tmin      d1    NaN
6   MX17004  2010      4    tmax      d1    NaN
7   MX17004  2010      4    tmin      d1    NaN
8   MX17004  2010      5    tmax      d1    NaN
9   MX17004  2010      5    tmin      d1    NaN

#### In order to make this dataset tidy, we want to move the three misplaced variables (tmin, tmax and days) as three individual columns: tmin. tmax and date.

In [20]:
df.dtypes

id          object
year         int64
month        int64
element     object
day_raw     object
value      float64
dtype: object

In [21]:
# Extracting day
df["day"] = df["day_raw"].str.extract("d(\d+)", expand=False) 
df["id"] = "MX17004"

In [22]:
# To numeric values
df[["year","month","day"]] = df[["year","month","day"]].apply(lambda x: pd.to_numeric(x, errors='ignore'))

In [23]:
df.dtypes

id          object
year         int64
month        int64
element     object
day_raw     object
value      float64
day          int64
dtype: object

### One Way to convert/join colums to form date

In [ ]:
# Creating a date from the different columns, creating a method
def create_date_from_year_month_day(row):
    return datetime.datetime(year=row["year"], month=int(row["month"]), day=row["day"])

In [27]:
df["date"] = df.apply(lambda row: create_date_from_year_month_day(row), axis=1)
df[:6]

        id  year  month element day_raw  value  day       date
0  MX17004  2010      1    tmax      d1    NaN    1 2010-01-01
1  MX17004  2010      1    tmin      d1    NaN    1 2010-01-01
2  MX17004  2010      2    tmax      d1    NaN    1 2010-02-01
3  MX17004  2010      2    tmin      d1    NaN    1 2010-02-01
4  MX17004  2010      3    tmax      d1    NaN    1 2010-03-01
5  MX17004  2010      3    tmin      d1    NaN    1 2010-03-01

In [47]:
df.dtypes

id                 object
year                int64
month               int64
element            object
day_raw            object
value             float64
day                 int64
date       datetime64[ns]
datemy             object
dtype: object

### My Way, method 2 to join colums and morning a date

In [45]:
df["datemy"]=df['year'].map(str) + "-" + df['month'].map(str)+ "-"+df['day'].map(str)

In [46]:
df["datemy"][3]

'2010-2-1'

In [49]:
df["datemy"] =  pd.to_datetime(df["datemy"], format='%Y-%m-%d')

In [50]:
df.dtypes

id                 object
year                int64
month               int64
element            object
day_raw            object
value             float64
day                 int64
date       datetime64[ns]
datemy     datetime64[ns]
dtype: object

In [51]:
df[:6]

        id  year  month element day_raw  value  day       date     datemy
0  MX17004  2010      1    tmax      d1    NaN    1 2010-01-01 2010-01-01
1  MX17004  2010      1    tmin      d1    NaN    1 2010-01-01 2010-01-01
2  MX17004  2010      2    tmax      d1    NaN    1 2010-02-01 2010-02-01
3  MX17004  2010      2    tmin      d1    NaN    1 2010-02-01 2010-02-01
4  MX17004  2010      3    tmax      d1    NaN    1 2010-03-01 2010-03-01
5  MX17004  2010      3    tmin      d1    NaN    1 2010-03-01 2010-03-01

#### Reference: Convert Pandas Column to DateTime
            http://stackoverflow.com/questions/26763344/convert-pandas-column-to-datetime
            http://strftime.org/

In [53]:
df = df.drop(['year',"month","day", "day_raw", "date"], axis=1)

In [54]:
df = df.dropna()

In [55]:
df[:3]

         id element  value     datemy
12  MX17004    tmax   27.3 2010-02-02
13  MX17004    tmin   14.4 2010-02-02
22  MX17004    tmax   24.1 2010-02-03

### Unmelting

In [56]:
# Unmelting column "element"
df = df.pivot_table(index=["id","datemy"], columns="element", values="value")

In [57]:
df

element             tmax  tmin
id      datemy
MX17004 2010-02-02  27.3  14.4
        2010-02-03  24.1  14.4
        2010-03-05  32.1  14.2

In [58]:
df.reset_index(drop=False, inplace=True)
df

element       id     datemy  tmax  tmin
0        MX17004 2010-02-02  27.3  14.4
1        MX17004 2010-02-03  24.1  14.4
2        MX17004 2010-03-05  32.1  14.2

### I want "tmin" first, so rearrange the col

In [59]:
df=df[['id','datemy','tmin','tmax']]
df

element       id     datemy  tmin  tmax
0        MX17004 2010-02-02  14.4  27.3
1        MX17004 2010-02-03  14.4  24.1
2        MX17004 2010-03-05  14.2  32.1